Actor(
  (_pi_net): Sequential(
    (0): BatchNorm1d(24)
    (1): Linear(in_features=24, out_features=128)
    (2): BatchNorm1d(128)
    (3): ReLU()
    (4): Linear(in_features=128, out_features=128)
    (5): BatchNorm1d(128)
    (6): ReLU()
    (7): Linear(in_features=128, out_features=2)
    (8): Tanh()
  )
)
