Critic(
  (_q_state_net): Sequential(
    (0): BatchNorm1d(24)
    (1): Linear(in_features=24, out_features=128)
    (2): ReLU()
  )
  (_q_net): Sequential(
    (0): Linear(in_features=130, out_features=128)
    (1): ReLU()
    (2): Linear(in_features=128, out_features=1)
  )
)
